backend: tensorflow
class_name: Sequential
config:
- class_name: Model
  config:
    input_layers:
    - [input_5, 0, 0]
    layers:
    - class_name: InputLayer
      config:
        batch_input_shape: !!python/tuple [null, 150, 150, 3]
        dtype: float32
        name: input_5
        sparse: false
      inbound_nodes: []
      name: input_5
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: &id001 !!python/tuple [1, 1]
        filters: 32
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_377
        padding: valid
        strides: !!python/tuple [2, 2]
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - input_5
          - 0
          - 0
          - {}
      name: conv2d_377
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_377
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_377
          - 0
          - 0
          - {}
      name: batch_normalization_377
    - class_name: Activation
      config: {activation: relu, name: activation_377, trainable: false}
      inbound_nodes:
      - - - batch_normalization_377
          - 0
          - 0
          - {}
      name: activation_377
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 32
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_378
        padding: valid
        strides: &id002 !!python/tuple [1, 1]
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - activation_377
          - 0
          - 0
          - {}
      name: conv2d_378
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_378
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_378
          - 0
          - 0
          - {}
      name: batch_normalization_378
    - class_name: Activation
      config: {activation: relu, name: activation_378, trainable: false}
      inbound_nodes:
      - - - batch_normalization_378
          - 0
          - 0
          - {}
      name: activation_378
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_379
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - activation_378
          - 0
          - 0
          - {}
      name: conv2d_379
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_379
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_379
          - 0
          - 0
          - {}
      name: batch_normalization_379
    - class_name: Activation
      config: {activation: relu, name: activation_379, trainable: false}
      inbound_nodes:
      - - - batch_normalization_379
          - 0
          - 0
          - {}
      name: activation_379
    - class_name: MaxPooling2D
      config:
        data_format: channels_last
        name: max_pooling2d_17
        padding: valid
        pool_size: !!python/tuple [3, 3]
        strides: !!python/tuple [2, 2]
        trainable: false
      inbound_nodes:
      - - - activation_379
          - 0
          - 0
          - {}
      name: max_pooling2d_17
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 80
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [1, 1]
        name: conv2d_380
        padding: valid
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - max_pooling2d_17
          - 0
          - 0
          - {}
      name: conv2d_380
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_380
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_380
          - 0
          - 0
          - {}
      name: batch_normalization_380
    - class_name: Activation
      config: {activation: relu, name: activation_380, trainable: false}
      inbound_nodes:
      - - - batch_normalization_380
          - 0
          - 0
          - {}
      name: activation_380
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 192
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_381
        padding: valid
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - activation_380
          - 0
          - 0
          - {}
      name: conv2d_381
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_381
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_381
          - 0
          - 0
          - {}
      name: batch_normalization_381
    - class_name: Activation
      config: {activation: relu, name: activation_381, trainable: false}
      inbound_nodes:
      - - - batch_normalization_381
          - 0
          - 0
          - {}
      name: activation_381
    - class_name: MaxPooling2D
      config:
        data_format: channels_last
        name: max_pooling2d_18
        padding: valid
        pool_size: !!python/tuple [3, 3]
        strides: !!python/tuple [2, 2]
        trainable: false
      inbound_nodes:
      - - - activation_381
          - 0
          - 0
          - {}
      name: max_pooling2d_18
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [1, 1]
        name: conv2d_385
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - max_pooling2d_18
          - 0
          - 0
          - {}
      name: conv2d_385
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_385
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_385
          - 0
          - 0
          - {}
      name: batch_normalization_385
    - class_name: Activation
      config: {activation: relu, name: activation_385, trainable: false}
      inbound_nodes:
      - - - batch_normalization_385
          - 0
          - 0
          - {}
      name: activation_385
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 48
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [1, 1]
        name: conv2d_383
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - max_pooling2d_18
          - 0
          - 0
          - {}
      name: conv2d_383
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_386
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - activation_385
          - 0
          - 0
          - {}
      name: conv2d_386
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_383
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_383
          - 0
          - 0
          - {}
      name: batch_normalization_383
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_386
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_386
          - 0
          - 0
          - {}
      name: batch_normalization_386
    - class_name: Activation
      config: {activation: relu, name: activation_383, trainable: false}
      inbound_nodes:
      - - - batch_normalization_383
          - 0
          - 0
          - {}
      name: activation_383
    - class_name: Activation
      config: {activation: relu, name: activation_386, trainable: false}
      inbound_nodes:
      - - - batch_normalization_386
          - 0
          - 0
          - {}
      name: activation_386
    - class_name: AveragePooling2D
      config:
        data_format: channels_last
        name: average_pooling2d_37
        padding: same
        pool_size: !!python/tuple [3, 3]
        strides: !!python/tuple [1, 1]
        trainable: false
      inbound_nodes:
      - - - max_pooling2d_18
          - 0
          - 0
          - {}
      name: average_pooling2d_37
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [1, 1]
        name: conv2d_382
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - max_pooling2d_18
          - 0
          - 0
          - {}
      name: conv2d_382
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [5, 5]
        name: conv2d_384
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - activation_383
          - 0
          - 0
          - {}
      name: conv2d_384
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_387
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - activation_386
          - 0
          - 0
          - {}
      name: conv2d_387
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 32
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [1, 1]
        name: conv2d_388
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - average_pooling2d_37
          - 0
          - 0
          - {}
      name: conv2d_388
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_382
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_382
          - 0
          - 0
          - {}
      name: batch_normalization_382
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_384
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_384
          - 0
          - 0
          - {}
      name: batch_normalization_384
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_387
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_387
          - 0
          - 0
          - {}
      name: batch_normalization_387
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_388
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_388
          - 0
          - 0
          - {}
      name: batch_normalization_388
    - class_name: Activation
      config: {activation: relu, name: activation_382, trainable: false}
      inbound_nodes:
      - - - batch_normalization_382
          - 0
          - 0
          - {}
      name: activation_382
    - class_name: Activation
      config: {activation: relu, name: activation_384, trainable: false}
      inbound_nodes:
      - - - batch_normalization_384
          - 0
          - 0
          - {}
      name: activation_384
    - class_name: Activation
      config: {activation: relu, name: activation_387, trainable: false}
      inbound_nodes:
      - - - batch_normalization_387
          - 0
          - 0
          - {}
      name: activation_387
    - class_name: Activation
      config: {activation: relu, name: activation_388, trainable: false}
      inbound_nodes:
      - - - batch_normalization_388
          - 0
          - 0
          - {}
      name: activation_388
    - class_name: Concatenate
      config: {axis: 3, name: mixed0, trainable: false}
      inbound_nodes:
      - - - activation_382
          - 0
          - 0
          - &id003 {}
        - - activation_384
          - 0
          - 0
          - *id003
        - - activation_387
          - 0
          - 0
          - *id003
        - - activation_388
          - 0
          - 0
          - *id003
      name: mixed0
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [1, 1]
        name: conv2d_392
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - mixed0
          - 0
          - 0
          - {}
      name: conv2d_392
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_392
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_392
          - 0
          - 0
          - {}
      name: batch_normalization_392
    - class_name: Activation
      config: {activation: relu, name: activation_392, trainable: false}
      inbound_nodes:
      - - - batch_normalization_392
          - 0
          - 0
          - {}
      name: activation_392
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 48
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [1, 1]
        name: conv2d_390
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - mixed0
          - 0
          - 0
          - {}
      name: conv2d_390
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_393
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - activation_392
          - 0
          - 0
          - {}
      name: conv2d_393
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_390
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_390
          - 0
          - 0
          - {}
      name: batch_normalization_390
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_393
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_393
          - 0
          - 0
          - {}
      name: batch_normalization_393
    - class_name: Activation
      config: {activation: relu, name: activation_390, trainable: false}
      inbound_nodes:
      - - - batch_normalization_390
          - 0
          - 0
          - {}
      name: activation_390
    - class_name: Activation
      config: {activation: relu, name: activation_393, trainable: false}
      inbound_nodes:
      - - - batch_normalization_393
          - 0
          - 0
          - {}
      name: activation_393
    - class_name: AveragePooling2D
      config:
        data_format: channels_last
        name: average_pooling2d_38
        padding: same
        pool_size: !!python/tuple [3, 3]
        strides: !!python/tuple [1, 1]
        trainable: false
      inbound_nodes:
      - - - mixed0
          - 0
          - 0
          - {}
      name: average_pooling2d_38
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [1, 1]
        name: conv2d_389
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - mixed0
          - 0
          - 0
          - {}
      name: conv2d_389
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [5, 5]
        name: conv2d_391
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - activation_390
          - 0
          - 0
          - {}
      name: conv2d_391
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_394
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - activation_393
          - 0
          - 0
          - {}
      name: conv2d_394
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [1, 1]
        name: conv2d_395
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - average_pooling2d_38
          - 0
          - 0
          - {}
      name: conv2d_395
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_389
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_389
          - 0
          - 0
          - {}
      name: batch_normalization_389
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_391
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_391
          - 0
          - 0
          - {}
      name: batch_normalization_391
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_394
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_394
          - 0
          - 0
          - {}
      name: batch_normalization_394
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_395
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_395
          - 0
          - 0
          - {}
      name: batch_normalization_395
    - class_name: Activation
      config: {activation: relu, name: activation_389, trainable: false}
      inbound_nodes:
      - - - batch_normalization_389
          - 0
          - 0
          - {}
      name: activation_389
    - class_name: Activation
      config: {activation: relu, name: activation_391, trainable: false}
      inbound_nodes:
      - - - batch_normalization_391
          - 0
          - 0
          - {}
      name: activation_391
    - class_name: Activation
      config: {activation: relu, name: activation_394, trainable: false}
      inbound_nodes:
      - - - batch_normalization_394
          - 0
          - 0
          - {}
      name: activation_394
    - class_name: Activation
      config: {activation: relu, name: activation_395, trainable: false}
      inbound_nodes:
      - - - batch_normalization_395
          - 0
          - 0
          - {}
      name: activation_395
    - class_name: Concatenate
      config: {axis: 3, name: mixed1, trainable: false}
      inbound_nodes:
      - - - activation_389
          - 0
          - 0
          - &id004 {}
        - - activation_391
          - 0
          - 0
          - *id004
        - - activation_394
          - 0
          - 0
          - *id004
        - - activation_395
          - 0
          - 0
          - *id004
      name: mixed1
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [1, 1]
        name: conv2d_399
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - mixed1
          - 0
          - 0
          - {}
      name: conv2d_399
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_399
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_399
          - 0
          - 0
          - {}
      name: batch_normalization_399
    - class_name: Activation
      config: {activation: relu, name: activation_399, trainable: false}
      inbound_nodes:
      - - - batch_normalization_399
          - 0
          - 0
          - {}
      name: activation_399
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 48
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [1, 1]
        name: conv2d_397
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - mixed1
          - 0
          - 0
          - {}
      name: conv2d_397
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_400
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - activation_399
          - 0
          - 0
          - {}
      name: conv2d_400
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_397
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_397
          - 0
          - 0
          - {}
      name: batch_normalization_397
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_400
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_400
          - 0
          - 0
          - {}
      name: batch_normalization_400
    - class_name: Activation
      config: {activation: relu, name: activation_397, trainable: false}
      inbound_nodes:
      - - - batch_normalization_397
          - 0
          - 0
          - {}
      name: activation_397
    - class_name: Activation
      config: {activation: relu, name: activation_400, trainable: false}
      inbound_nodes:
      - - - batch_normalization_400
          - 0
          - 0
          - {}
      name: activation_400
    - class_name: AveragePooling2D
      config:
        data_format: channels_last
        name: average_pooling2d_39
        padding: same
        pool_size: !!python/tuple [3, 3]
        strides: !!python/tuple [1, 1]
        trainable: false
      inbound_nodes:
      - - - mixed1
          - 0
          - 0
          - {}
      name: average_pooling2d_39
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [1, 1]
        name: conv2d_396
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - mixed1
          - 0
          - 0
          - {}
      name: conv2d_396
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [5, 5]
        name: conv2d_398
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - activation_397
          - 0
          - 0
          - {}
      name: conv2d_398
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 96
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [3, 3]
        name: conv2d_401
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - activation_400
          - 0
          - 0
          - {}
      name: conv2d_401
    - class_name: Conv2D
      config:
        activation: linear
        activity_regularizer: null
        bias_constraint: null
        bias_initializer:
          class_name: Zeros
          config: {}
        bias_regularizer: null
        data_format: channels_last
        dilation_rate: *id001
        filters: 64
        kernel_constraint: null
        kernel_initializer:
          class_name: VarianceScaling
          config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
        kernel_regularizer: null
        kernel_size: !!python/tuple [1, 1]
        name: conv2d_402
        padding: same
        strides: *id002
        trainable: false
        use_bias: false
      inbound_nodes:
      - - - average_pooling2d_39
          - 0
          - 0
          - {}
      name: conv2d_402
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_396
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_396
          - 0
          - 0
          - {}
      name: batch_normalization_396
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
        gamma_constraint: null
        gamma_initializer:
          class_name: Ones
          config: {}
        gamma_regularizer: null
        momentum: 0.99
        moving_mean_initializer:
          class_name: Zeros
          config: {}
        moving_variance_initializer:
          class_name: Ones
          config: {}
        name: batch_normalization_398
        scale: false
        trainable: false
      inbound_nodes:
      - - - conv2d_398
          - 0
          - 0
          - {}
      name: batch_normalization_398
    - class_name: BatchNormalization
      config:
        axis: 3
        beta_constraint: null
        beta_initializer:
          class_name: Zeros
          config: {}
        beta_regularizer: null
        center: true
        epsilon: 0.001
